package com.nanlan.lixinger.terms

/**
 * 现金流量表 Cash Flow sheet
 */
enum class CashFlowSheet(val key: String = "") {
    // 一、 经营活动产生的现金流量
    `销售商品、提供劳务收到的现金`("crfscapls"),
    `发放贷款及垫款的净减少额`("ndilaatc"),
    `客户存款和同业及其他金融机构存放款项净增加额`("niicdadfbaofi"),
    `向中央银行借款净增加额`("niibfcb"),
    `向其他金融机构拆入资金净增加额`("niipfofi"),
    `收到原保险合同保费取得的现金`("crfp"),
    `收到再保险业务现金净额`("ncrfrib"),
    `保户储金及投资款净增加额`("niiphd"),
    `为交易目的而持有的金融资产净减少额`("ndifahftp"),
    `拆入资金净增加额`("niipfbaofi"),
    `卖出回购业务资金净增加额`("niifasurpaioa"),
    `收取利息、手续费及佣金的现金`("crfifac"),
    `代理买卖证券收到的现金净额`("ncrfstoa"),
    `收到的税费返还`("crfwbot"),
    `收到的其他与经营活动有关现金`("crrtooa"),
    `经营活动现金流入小计`("stciffoa"),
    `购买商品、接收劳务支付的现金`("cpfpcarls"),
    `发放贷款及垫款的净增加额`("niilaatc"),
    `存放中央银行和同业及其他金融机构款项净增加额`("niibwcbbaofi"),
    `向其他金融机构拆入资金净减少额`("ndipfofi"),
    `支付原保险合同赔付等款项的现金`("cpfc"),
    `拆出资金增加额`("niipwbaofi"),
    `买入返售金融资产净增加额`("niifahursaioa"),
    `支付保单红利的现金`("cpfphd"),
    `为交易目的而持有的金融资产净增加额`("niifahftp"),
    `支付利息、手续费及佣金的现金`("cpfifac"),
    `支付给职工及为职工支付的现金`("cptofe"),
    `支付的各种税费`("cpft"),
    `支付的其他与经营活动有关现金`("cprtooa"),
    `经营活动现金流出小计`("stcoffoa"),
    `经营活动产生的现金流量净额`("ncffoa"),


    // 二、 投资活动产生的现金流量金额
    `收回投资收到的现金`("crfrci"),
    `取得投资收益所收到的现金`("crfii"),
    `处置固定资产、无形资产及其他长期资产收到的现金`("crfdofiaolta"),
    `处置子公司、合营联营企业及其他营业单位收到的现金净额`("ncrfdossajvaou"),
    `(其中) 处置子公司或其他营业单位收到的现金净额`("ncrfdossaou"),
    `(其中) 处置合营或联营公司所收到的现金`("ncrfdoaajv"),
    `收到的其他与投资活动相关的现金`("crrtoia"),
    `投资活动现金流入小计`("stcifia"),
    `购建固定资产、无形资产及其他长期资产所支付的现金`("cpfpfiaolta"),
    `投资所支付的现金`("cpfi"),
    `质押贷款净增加额`("niipl"),
    `取得子公司、合营联营企业及其他营业单位支付的现金净额`("ncpfbssajvaou"),
    `(其中) 取得子公司及其营业单位支付的现金净额`("ncpfbssaou"),
    `(其中) 取得联营及合营公司支付的现金净额`("ncpfbajv"),
    `支付的其他与投资活动有关的现金`("cprtoia"),
    `投资活动现金流出小计`("stcoffia"),
    `投资活动产生的现金流量净额`("ncffia"),


    // 三、 筹资活动产生的现金流量
    `吸收投资收到的现金`("crfai"),
    `(其中) 子公司吸收少数股东投资收到的现金`("crfamshibss"),
    `取得借款收到的现金`("crfl"),
    `发行债券收到的现金`("crfib"),
    `收到的其他与筹资活动有关的现金`("crrtofa"),
    `筹资活动产生的现金流入小计`("stcifffa"),
    `偿付债务支付的现金`("cpfbrp"),
    `分配股利、利润或偿付利息所支付的现金`("cpfdapdoi"),
    `(其中) 子公司支付少数股东股利及利润`("cpfdapomshpbss"),
    `支付的其他与筹资活动有关的现金`("cprtofa"),
    `筹资活动产生的现金流出小计`("stcofffa"),
    `筹资活动产生的现金流量净额`("ncfffa"),


    // 四、汇率变动对现金及现金等价物的影响
    `汇率变动对现金及现金等价物的影响`("iocacedtfier"),
    `期初现金及现金等价物的余额`("bocaceatpb"),
    `现金及现金等价物的净增加额`("niicace"),
    `期末现金及现金等价物净余额`("bocaceatpe"),


    // 五、 附注
    `净利润`("np"),
    `加： 资产减值准备`("ioa"),
    `信用减值损失`("cilor"),
    `固定资产折旧、油气资产折耗、生产性生物资产折旧`("dofx_dooaga_dopba"),
    `投资性房地产的折旧及摊销`("daaorei"),
    `无形资产摊销`("aoia"),
    `长期待摊费用摊销`("aoltde"),
    `处置固定资产、无形资产和其他长期资产的损失`("lodofaiaaolta"),
    `固定资产报废损失`("lfsfa"),
    `公允价值变动损失`("lfcifv"),
    `财务费用`("fe"),
    `投资损失`("il"),
    `递延所得税资产减少`("didita"),
    `递延所得税负债增加`("iiditl"),
    `存货的减少`("dii"),
    `经营性应收项目的减少`("dior"),
    `经营性应付项目的增加`("iiop"),
    `其他`("o"),
    `债务转为资本`("coditc"),
    `一年内到期的可转换公司债券`("cbdwioy"),
    `融资租入固定资产`("flofa"),

    ;

    val wholeKey: String = "cfs.${this.key}"
}