package com.nanlan.lixinger.terms

/**
 * 财务指标 metrics
 */
enum class Metrics(val key: String = "") {
    // 一、 人均指标
    `员工人数`("ep_stn"),
    `人均营业总收入`("toi_pc"),
    `人均净利润`("np_pc"),
    `人均薪酬`("s_pc"),


    // 二、 每股指标
    `归属于母公司普通股股东的每股收益`("npatoshopc_ps"),
    `归属于母公司普通股股东的每股扣非收益`("npadnrpatoshaopc_ps"),
    `归属于母公司普通股股东的每股股东权益`("tetoshopc_ps"),
    `每股资本公积`("cr_ps"),
    `每股未分配利润`("rp_ps"),
    `每股经营活动产生的现金流量`("stciffoa_ps"),
    `每股经营活动产生的现金流量净额`("ncffoa_ps"),


    // 三、 盈利能力
    `归属于母公司普通股股东的ROE`("roe_atoshaopc"),
    `归属于母公司普通股股东的扣非ROE`("roe_adnrpatoshaopc"),
    `归属于母公司普通股股东的加权ROE`("wroe"),
    `净资产收益率(ROE)`("roe"),
    `杠杆倍数`("l"),
    `总资产收益率(ROA)`("roa"),
    `资产周转率`("ta_to"),
    `净利润率`("np_s_r"),
    `毛利率(GM)`("gp_m"),
    `有形资产回报率(ROTA)`("rota"),
    `资本回报率(ROIC)`("roic"),
    `资本收益率(ROC)`("roc"),


    // 四、 营运能力(周转率)
    `预付账款周转率`("ats_tor"),
    `合同资产周转率`("ca_tor"),
    `存货周转率`("i_tor"),
    `应收票据和应收账款周转率`("nraar_tor"),
    `应收票据周转率`("nr_tor"),
    `应收账款周转率`("ar_tor"),
    `应收款项融资周转率`("rf_tor"),
    `预收账款周转率`("afc_tor"),
    `合同负债周转率`("cl_tor"),
    `应付票据和应付账款周转率`("npaap_tor"),
    `应付票据周转率`("np_tor"),
    `应付账款周转率`("ap_tor"),
    `固定资产周转率`("fa_tor"),


    // 五、 营运能力(周转天数)
    `预付账款周转天数`("ats_ds"),
    `合同资产周转天数`("ca_ds"),
    `存货周转天数`("i_ds"),
    `应收票据和应收账款周转天数`("nraar_ds"),
    `应收票据周转天数`("nr_ds"),
    `应收账款周转天数`("ar_ds"),
    `应收款项融资周转天数`("rf_ds"),
    `预收账款周转天数`("afc_ds"),
    `合同负债周转天数`("cl_ds"),
    `应付票据和应付账款周转天数`("npaap_ds"),
    `应付票据周转天数`("np_ds"),
    `应付账款周转天数`("ap_ds"),
    `营业周转天数`("b_ds"),
    `净现金周转天数(CCC)`("m_ds"),
    `固定资产周转天数`("fa_ds"),
    `流动资产周转天数`("tca_ds"),
    `股东权益周转天数`("toe_ds"),
    `总资产周转天数`("ta_ds"),


    // 六、 偿债及资本结构
    `资产负债率`("tl_ta_r"),
    `有息负债率`("lwi_ta_r"),
    `货币资金占流动负债比率`("cabb_tcl_r"),
    `流动比率`("c_r"),
    `速动比率`("q_r"),
    `固定资产占总资产比率`("fa_ta_r"),
    `清算价值比率`("lv_r"),


    // 七、 现金流量
    `自由现金流量`("fcf"),
    `销售商品提供劳务收到的现金对营业收入的比率`("crfscapls_oi_r"),
    `经营活动产生的现金流量净额对营业利润的比率`("ncffoa_op_r"),
    `经营活动产生的现金流量净额对净利润的比率`("ncffoa_np_r"),
    `销售商品提供劳务收到的现金对总资产的比率`("crfscapls_ta_r"),
    `经营活动产生的现金流量净额对固定资产的比率`("ncffoa_fa_r"),

    ;

    val wholeKey: String = "m.${this.key}"
}