package com.nanlan.lixinger.terms

/**
 * 利润表 profit sheet
 */
enum class ProfitSheet(val key: String = "") {
    `营业总收入`("toi"),
    `营业收入`("oi"),
    `利息收入`("ii"),
    `已赚保费`("ep"),
    `手续费及佣金收入`("faci"),
    `其他业务收入`("ooi"),

    /*-----------------------------------------------------*/
    `营业总成本`("toc"),
    `营业成本`("oc"),
    `毛利率(GM)`("gp_m"),
    `利息支出`("ie"),
    `手续费及佣金支出`("face"),
    `退保金`("s"),
    `保险合同赔付支出`("ce"),
    `提取保险责任准备金净额`("iiicr"),
    `保单红利支出`("phdrfpip"),
    `分保费用`("rie"),
    `税金及附加`("tas"),
    `销售费用`("se"),
    `管理费用`("ae"),
    `研发费用`("rade"),
    `财务费用`("fe"),
    `(其中) 利息费用`("ieife"),
    `(其中) 利息收入`("iiife"),
    `销售费用率`("se_r"),
    `管理费用率`("ae_r"),
    `研发费用率`("rade_r"),
    `财务费用率`("fe_r"),
    `总营业费用率`("oe_r"),
    `三项费用率`("te_r"),
    `加： 其他收益`("oic"),
    `投资收益`("ivi"),
    `(其中) 对联营企业及合营企业的投资收益`("iifaajv"),
    `(其中) 以摊余成本计量的金融资产终止确认产生的投资收益`("iftdofamaac"),
    `汇兑收益`("ei"),
    `净敞口套期收益`("nehb"),
    `公允价值变动收益`("ciofv"),
    `信用减值损失`("cilor"),
    `资产减值损失`("ailor"),
    `其他资产减值损失`("oail"),
    `资产处置收益`("adi"),
    `其他业务成本`("ooe"),
    `核心利润`("cp"),
    `核心利润率`("cp_r"),

    /*-----------------------------------------------------*/
    `营业利润`("op"),
    `营业利润率`("op_s_r"),
    `其他营业利润率`("op_op_r"),
    `加： 营业外收入`("noi"),
    `(其中) 非流动资产毁损报废利得`("ncadarg"),
    `减： 营业外支出`("noe"),
    `(其中) 非流动资产毁损报废损失`("ncadarl"),

    /*-----------------------------------------------------*/
    `利润总额`("tp"),
    `研发费占利润总额比值`("rade_tp_r"),
    `息税前净利润(EBIT)`("ebit"),
    `息税折旧及摊销前盈利(EBITDA)`("ebitda"),
    `减： 所得税费用`("ite"),
    `有效税率`("ite_tp_r"),

    /*-----------------------------------------------------*/
    `净利润`("np"),
    `净利润率`("np_s_r"),
    `(一) 持续经营净利润`("npfco"),
    `(二) 终止经营净利润`("npfdco"),
    `归属于母公司股东及其他权益持有者的净利润`("npatshaoehopc"),
    `归属于母公司普通股股东的净利润`("npatoshopc"),
    `少数股东损益`("npatmsh"),
    `归属于母公司普通股股东的扣除非经常性损益的净利润`("npadnrpatoshaopc"),
    `扣非净利润占比`("npadnrpatoshaopc_npatoshopc_r"),
    `归属于母公司普通股股东的加权ROE`("wroe"),
    `归属于母公司普通股股东的扣非加权ROE`("wdroe"),

    /*-----------------------------------------------------*/
    `基本每股收益`("beps"),
    `稀释每股收益`("deps"),

    /*-----------------------------------------------------*/
    `综合收益总额`("tci"),
    `归属于母公司股东及其他权益持有者的综合收益总额`("tciatshaoehopc"),
    `归属于母公司普通股股东的综合收益总额`("tciatoshopc"),
    `归属于少数股东的综合收益总额`("tciatmsh"),
    `其他综合收益的税后净额`("natooci"),

    ;

    val wholeKey: String = "ps.${this.key}"
}